tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"
# Command-line interface for SQLite
brew "sqlite"
# C/C++/ObjC language server
brew "ccls"
# Cross-platform make
brew "cmake"
# Tool for browsing source code
brew "cscope"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Source code tag system
brew "global"
# Manage compile and link flags for libraries
brew "pkg-config"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Middleware to access a smart card using SCard API
brew "pcsc-lite"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# JavaScript package manager
brew "yarn"
# App to build and share containerized applications and microservices
cask "docker"

cask "microsoft-teams"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "vlc"
cask "mplayer-osx-extended"
cask "docker"
cask "dropbox"
cask "visual-studio-code"
cask "welly"
